eawag-squid/SQUID/software/source/hardware/apminimax/avr/boards.txt
# Eawag Board Contribution Configuration
#
# For more information see:
# * https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5---3rd-party-Hardware-specification
# * https://github.com/arduino/Arduino/wiki/Arduino-Hardware-Cores-migration-guide-from-1.0-to-1.6
#

menu.cpu=Processor
##############################################################
apminimax.name=SQuiD APMiniMax 8MHz

apminimax.upload.tool=arduino:avrdude
apminimax.upload.protocol=arduino
apminimax.upload.maximum_size=130048
apminimax.upload.maximum_data_size=16384
apminimax.upload.speed=57600

apminimax.bootloader.tool=arduino:avrdude
apminimax.bootloader.low_fuses=0xFF
apminimax.bootloader.high_fuses=0x9E
apminimax.bootloader.extended_fuses=0xFD
#apminimax.bootloader.path=optiboot
apminimax.bootloader.file=optiboot_atmega1284p/optiboot_atmega1284p.hex
apminimax.bootloader.unlock_bits=0x3F
apminimax.bootloader.lock_bits=0xFF

apminimax.build.mcu=atmega1284p
apminimax.build.f_cpu=8000000L
apminimax.build.core=arduino:arduino
apminimax.build.variant=apminimax
apminimax.build.board=AVR_APMINIMAX
